In [5]:
import pandas as pd

marsons_df = pd.read_csv('pub_data_result.csv')
marsons_df.columns =['pub_name', 'address', 'item_name', 'item_price', 'opening_times']
marsons_df.head(5)

,pub_name,address,item_name,item_price,opening_times
0,Blue Jay Derby,"Derby, DE21 7HX",Soup of the Day (Ve),£4.70,07:00 - 23:00
1,Blue Jay Derby,"Derby, DE21 7HX",Crispy Buttermilk Chicken Goujons for One,£5.60,07:00 - 23:00
2,Blue Jay Derby,"Derby, DE21 7HX",Brie Dippers for One (V)*,£5.60,07:00 - 23:00
3,Blue Jay Derby,"Derby, DE21 7HX",Mexican Nachos for One (V),£5.60,07:00 - 23:00
4,Blue Jay Derby,"Derby, DE21 7HX",Mexican Nachos for One (Ve),£5.60,07:00 - 23:00

In [6]:
marsons_df.describe()

,pub_name,address,item_name,item_price,opening_times
count,12465,12465,12444,12444,12444
unique,43,43,1400,242,6
top,Cobblestones March,"March, PE15 0BA",Blackcurrant Cordial - 14oz,£4.95,09:00 - 23:00
freq,737,737,42,351,8967